; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared0 - mode
	spectrograph1 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star3 - direction
	Star2 - direction
	Star4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star4)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star2)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
)
(:goal (and
	(have_image Phenomenon5 infrared0)
	(have_image Phenomenon6 spectrograph1)
	(have_image Planet7 infrared0)
	(have_image Star8 spectrograph1)
	(have_image Phenomenon9 infrared0)
	(have_image Planet10 spectrograph1)
	(have_image Planet11 spectrograph1)
	(have_image Phenomenon12 infrared0)
	(have_image Phenomenon13 spectrograph1)
	(have_image Planet14 infrared0)
))

)

; plan
1. (turn_to satellite0 star4 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star4)
   goals met: 0 of 10
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 10
3. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 0 of 10
4. (turn_to satellite0 phenomenon5 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon5)
   goals met: 0 of 10
5. (take_image satellite0 phenomenon5 instrument0 infrared0)
   added: (have_image phenomenon5 infrared0)
   goals met: 1 of 10
6. (turn_to satellite0 phenomenon13 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon13)
   goals met: 1 of 10
7. (take_image satellite0 phenomenon13 instrument0 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 2 of 10
8. (turn_to satellite0 phenomenon12 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 10
9. (take_image satellite0 phenomenon12 instrument0 infrared0)
   added: (have_image phenomenon12 infrared0)
   goals met: 3 of 10
10. (turn_to satellite0 phenomenon6 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon6)
   goals met: 3 of 10
11. (take_image satellite0 phenomenon6 instrument0 spectrograph1)
   added: (have_image phenomenon6 spectrograph1)
   goals met: 4 of 10
12. (turn_to satellite0 phenomenon9 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 10
13. (take_image satellite0 phenomenon9 instrument0 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 5 of 10
14. (turn_to satellite0 planet10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet10)
   goals met: 5 of 10
15. (take_image satellite0 planet10 instrument0 spectrograph1)
   added: (have_image planet10 spectrograph1)
   goals met: 6 of 10
16. (turn_to satellite0 planet11 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet11)
   goals met: 6 of 10
17. (take_image satellite0 planet11 instrument0 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 7 of 10
18. (turn_to satellite0 planet14 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet14)
   goals met: 7 of 10
19. (take_image satellite0 planet14 instrument0 infrared0)
   added: (have_image planet14 infrared0)
   goals met: 8 of 10
20. (turn_to satellite0 planet7 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet7)
   goals met: 8 of 10
21. (take_image satellite0 planet7 instrument0 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 9 of 10
22. (turn_to satellite0 star8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star8)
   goals met: 9 of 10
23. (take_image satellite0 star8 instrument0 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 10 of 10
